//Task_1.Զանգվածի անկյունագծերի հատման կետից վերև և ներքև տեղադրել 0-ներ, աջ ու ձախ՝ 2-ներ:
const myArray2 = [
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
	[8, 8, 8, 8, 8, 8, 8, 8, 8, 8]
];
let len2 = myArray2.length, s,t;
for (s = 0; s < len2; s++){
	for(t = 0; t < len2; t++){
		if(t == s){
			myArray2[s][t] = 1;
		}
		else if(t == len2 - 1 - s){
			myArray2[s][t] = 1;
		}
		else if(t > s && t < len2 - s){
			myArray2[s][t] = 0;
			
		}
		else if(t < s && t > len2 - s){
			myArray2[s][t] = 0;
		}
		else myArray2[s][t] = 2;
		
	}
}
console.log(myArray2);
		
		